# GetMirrorEmpty2DComp

## Description
Gets whether the opposite view graphics are mirrored for empty 2D components of a symbol definition or plug-in object.

```pascal
FUNCTION GetMirrorEmpty2DComp(objectHandle : HANDLE) : BOOLEAN;
```

```python

def vs.GetMirrorEmpty2DComp(objectHandle):
    return BOOLEAN
```

## Parameters
|Name|Type|Description|
|---|---|---|
|objectHandle|HANDLE|Handle of a symbol or plug-in object.|

## Returns
TRUE if the opposite view graphics are mirrored for empty 2D components of a symbol definition or plug-in object.

## See Also
VS Functions:
SetMirrorEmpty2DComp| Get2DComponentGroup| Set2DComponentGroup

## Version
Availability: from Vectorworks 2019
## Category
* Objects - Custom